xsub/OpenBSD-src/share/man/man4/dkzone.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2026 Pawel Suchanecki <subdcc@gmail.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 5 2026 $
.Dt DKZONE 4
.Os
.Sh NAME
.Nm dkzone
.Nd zoned disk ioctl interface
.Sh SYNOPSIS
.In sys/dkio.h
.Sh DESCRIPTION
.Nm
defines a disk
.Xr ioctl 2
interface for discovering and reporting native zoned block devices.
The interface is shared by disk drivers that expose host-visible zones,
including
SCSI Zoned Block Commands devices and NVMe Zoned Namespaces.
.Pp
The first supported operations are deliberately read-only.
They allow userland to query whether a disk is zoned and to retrieve zone
descriptors.
Zone management commands that change device state, such as opening, closing,
finishing, or resetting a zone write pointer, are not part of this interface
yet.
.Pp
The following operations are defined in
.In sys/dkio.h :
.Bl -tag -width Ds
.It Dv DIOCGZONEINFO Fa "struct dk_zone_info *"
Read zoned disk capability and limit information.
The returned
.Fa dzi_version
field is set to
.Dv DK_ZONE_VERSION .
The
.Fa dzi_zone_mode
field is one of:
.Bl -tag -width DK_ZONE_MODE_HOST_MANAGED -compact
.It Dv DK_ZONE_MODE_NONE
The disk does not report native host-visible zoned block support.
.It Dv DK_ZONE_MODE_HOST_AWARE
The disk reports host-aware zones.
.It Dv DK_ZONE_MODE_DRIVE_MANAGED
The disk manages zones internally and appears as a conventional disk.
.It Dv DK_ZONE_MODE_HOST_MANAGED
The disk requires the host to obey sequential write rules for sequential zones.
.El
.Pp
The
.Fa dzi_flags
field describes supported reporting and zone management capabilities.
Drivers may also return zone size and resource limits such as maximum open
or active zones when the underlying protocol reports them.
.It Dv DIOCGZONEREPORT Fa "struct dk_zone_report *"
Read zone descriptors starting at
.Fa dzr_start_lba .
Before calling this operation, userland must set
.Fa dzr_version
to
.Dv DK_ZONE_VERSION ,
.Fa dzr_report_option
to one of the
.Dv DK_ZONE_REP_*
values, and
.Fa dzr_entries
and
.Fa dzr_zones
to describe the output array.
.Pp
On return,
.Fa dzr_entries_filled
is the number of descriptors copied to userland and
.Fa dzr_entries_available
is the number of descriptors reported by the device for the requested report.
Each descriptor is returned as a
.Vt struct dk_zone
containing the zone start LBA, length, capacity, write pointer, type,
condition, translated flags, and raw protocol values.
.El
.Sh FILES
.Bl -tag -width /dev/rsdXXXXX -compact
.It Pa /dev/rsd Ns Ar u Ns Ar p
raw disk device
.El
.Sh ERRORS
The
.Nm
ioctls may fail with:
.Bl -tag -width Er
.It Bq Er EINVAL
The ABI version, report option, or output pointer is invalid.
.It Bq Er EOPNOTSUPP
The disk or driver does not support zone reports.
.It Bq Er ENOTTY
The device does not implement the requested ioctl.
.It Bq Er ENXIO
The device is no longer available.
.It Bq Er ENOMEM
Kernel memory could not be allocated for a zone report.
.It Bq Er EIO
The device returned an invalid or failed zone report.
.It Bq Er EFAULT
Zone descriptors could not be copied to userland.
.El
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr nvme 4 ,
.Xr sd 4 ,
.Xr disklabel 5
.Sh CAVEATS
The current interface is read-only.
Host-managed zoned devices are exposed conservatively until the corresponding
disk driver has a zone-aware write path.
.Pp
.Nm
is an ioctl interface, not a user command or a standalone device node.
