xsub/OpenBSD-src/share/man/man4/dkzone.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2026 Pawel Suchanecki <subdcc@gmail.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: July 5 2026 $
.Dt DKZONE 4
.Os
.Sh NAME
.Nm dkzone
.Nd zoned disk ioctl interface
.Sh SYNOPSIS
.In sys/dkio.h
.Sh DESCRIPTION
.Nm
defines a disk
.Xr ioctl 2
interface for discovering, reporting, and managing native zoned block devices.
The interface is shared by disk drivers that expose host-visible zones,
including
SCSI Zoned Block Commands devices and NVMe Zoned Namespaces.
.Pp
Capability queries and zone reports are read-only.
Zone management commands change device state and require the device to be
opened for writing.
Normal write support for host-managed devices is a separate concern and may
remain disabled even when zone management commands are available.
.Pp
The following operations are defined in
.In sys/dkio.h :
.Bl -tag -width Ds
.It Dv DIOCGZONEINFO Fa "struct dk_zone_info *"
Read zoned disk capability and limit information.
The returned
.Fa dzi_version
field is set to
.Dv DK_ZONE_VERSION .
The
.Fa dzi_zone_mode
field is one of:
.Bl -tag -width DK_ZONE_MODE_HOST_MANAGED -compact
.It Dv DK_ZONE_MODE_NONE
The disk does not report native host-visible zoned block support.
.It Dv DK_ZONE_MODE_HOST_AWARE
The disk reports host-aware zones.
.It Dv DK_ZONE_MODE_DRIVE_MANAGED
The disk manages zones internally and appears as a conventional disk.
.It Dv DK_ZONE_MODE_HOST_MANAGED
The disk requires the host to obey sequential write rules for sequential zones.
.El
.Pp
The
.Fa dzi_flags
field describes supported reporting and zone management capabilities.
Drivers may also return zone size and resource limits such as maximum open
or active zones when the underlying protocol reports them.
.It Dv DIOCGZONEREPORT Fa "struct dk_zone_report *"
Read zone descriptors starting at
.Fa dzr_start_lba .
Zone reports use absolute device LBAs and must be issued to the raw disk
partition.
Before calling this operation, userland must set
.Fa dzr_version
to
.Dv DK_ZONE_VERSION ,
.Fa dzr_report_option
to one of the
.Dv DK_ZONE_REP_*
values, and
.Fa dzr_entries
and
.Fa dzr_zones
to describe the output array.
.Pp
The common report options are:
.Bl -tag -width DK_ZONE_REP_READONLY -compact
.It Dv DK_ZONE_REP_ALL
Return all zones.
.It Dv DK_ZONE_REP_EMPTY
Return empty zones.
.It Dv DK_ZONE_REP_IMP_OPEN
Return implicitly open zones.
.It Dv DK_ZONE_REP_EXP_OPEN
Return explicitly open zones.
.It Dv DK_ZONE_REP_CLOSED
Return closed zones.
.It Dv DK_ZONE_REP_FULL
Return full zones.
.It Dv DK_ZONE_REP_READONLY
Return read-only zones.
.It Dv DK_ZONE_REP_OFFLINE
Return offline zones.
.El
.Pp
Additional report options such as
.Dv DK_ZONE_REP_RESET ,
.Dv DK_ZONE_REP_NON_SEQ ,
and
.Dv DK_ZONE_REP_NON_WP
are protocol-dependent and may return
.Er EINVAL
on drivers or devices that cannot express them.
.Pp
On return,
.Fa dzr_entries_filled
is the number of descriptors copied to userland and
.Fa dzr_entries_available
is the number of descriptors reported by the device for the requested report.
The meaning of
.Fa dzr_entries_available
is protocol-dependent and may describe only the current report page; callers
must not use it as the total number of zones on the disk.
To enumerate zones, continue issuing reports with
.Fa dzr_start_lba
set to
.Fa dz_start_lba No + Fa dz_length_lba
from the last returned descriptor until no descriptors are returned, no
forward progress is possible, or
.Fa dzr_max_lba
is passed.
Each descriptor is returned as a
.Vt struct dk_zone
containing the zone start LBA, length, capacity, write pointer, type,
condition, translated flags, and raw protocol values.
If the underlying protocol marks the write pointer invalid for a full zone,
drivers report the logical end of the zone as
.Fa dz_start_lba No + Fa dz_capacity_lba .
.It Dv DIOCZONECMD Fa "struct dk_zone_op *"
Execute a zone management command.
Before calling this operation, userland must set
.Fa dzo_version
to
.Dv DK_ZONE_VERSION ,
.Fa dzo_op
to one of
.Dv DK_ZONE_OP_CLOSE ,
.Dv DK_ZONE_OP_FINISH ,
.Dv DK_ZONE_OP_OPEN ,
or
.Dv DK_ZONE_OP_RESET ,
and
.Fa dzo_lba
to the absolute device LBA of the target zone.
Zone management commands must be issued to the raw disk partition.
.Pp
If
.Dv DK_ZONE_OP_F_ALL
is set in
.Fa dzo_flags ,
.Fa dzo_lba
must be zero and the operation applies to all zones supported by the
underlying command.
This operation requires write access to the device.
.El
.Sh FILES
.Bl -tag -width /dev/rsdXXXXX -compact
.It Pa /dev/rsd Ns Ar u Ns Ar p
raw disk device
.El
.Sh ERRORS
The
.Nm
ioctls may fail with:
.Bl -tag -width Er
.It Bq Er EINVAL
The ABI version, report option, command option, flags, or output pointer is
invalid.
.It Bq Er EBADF
A zone management command was attempted without opening the device for writing.
.It Bq Er EOPNOTSUPP
The disk or driver does not support the requested zoned operation.
.It Bq Er ENOTTY
The device does not implement the requested ioctl.
.It Bq Er ENXIO
The device is no longer available.
.It Bq Er ENOMEM
Kernel memory could not be allocated for a zone report.
.It Bq Er EIO
The device returned an invalid or failed zone report.
.It Bq Er EFAULT
Zone descriptors could not be copied to userland.
.El
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr nvme 4 ,
.Xr sd 4 ,
.Xr disklabel 5
.Sh CAVEATS
Zone management commands can change device state.
In particular, resetting a zone moves its write pointer back to the start of
the zone and may discard data in that zone.
.Pp
Host-managed zoned devices are exposed conservatively.
The ordinary disk write path may reject writes until the corresponding disk
driver has zone-aware ordering and write-pointer checks.
.Pp
.Nm
is an ioctl interface, not a user command or a standalone device node.
